{"disqus":{"path":"/web/yui-datatable-and-you-making-the-marriage-work/","commentCount":7,"comments":[{"postId":"887461573","parentPostId":null,"date":"2007-05-15T19:11:01Z","author":"Victor","avatar":"https://www.gravatar.com/avatar/3d4ead73cf25658123411c5c640b40f2?d=mm&s=60","message":"<p>Very useful post!. Other interesting situation that you could add to your test suite is the combination of scrolling, nested table headers, and sorting when the datatable is *floated* (i.e. inside a YUI panel).</p><p>Regards,</p>","replies":[]},{"postId":"887461571","parentPostId":null,"date":"2007-05-15T21:19:15Z","author":"Harlan","avatar":"https://www.gravatar.com/avatar/d10ca8d11301c2f4993ac2279ce4b930?d=mm&s=60","message":"<p>Why not use Jack Slocum's Ext library that includes a fantastic DataGrid component?</p>","replies":[]},{"postId":"887461570","parentPostId":null,"date":"2007-05-17T08:26:11Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Great question, I have been following the Grid component in Jack Slocum's Ext library for awhile, and when I looked at it awhile ago (in the pre 1.0 release), it was a 500KB hit to use the Grid.  Now, with the build your own Ext feature, he's knocked it down to 175KB with all of the stock features that are also in YUI's DataTable.  That isn't bad, but the YUI DataTable is only 65KB and it is isn't going to have a different look and feel from the other YUI components in my application by default.</p><p>Another thing I like about all the YUI code is that it's BSD, a no-nonsense license.  There are 5 or 6 different licensing options on the Ext website, which is a bit confusing.</p><p>But personally, I just like YUI's stuff because using it makes me feel like I'm not riding the bike with training wheels.  I can learn about how the component works and customize it to my pleasure (with great CSS support built in) without having a drop and go stock application look and feel.  If you see any of Jack's stuff out on the web, you instantly recognize that it's using Ext.  I want people to see my stuff and think that I'm using my own hopes and dreams to run the application.</p>","replies":[]},{"postId":"887461572","parentPostId":null,"date":"2007-07-25T18:12:10Z","author":"Ted","avatar":"https://www.gravatar.com/avatar/5844a8b52aa0aad3f8217ddd89096f2a?d=mm&s=60","message":"<p>Firstly excellent post - really helped me out of a couple of weeks back.</p><p>Having had a quick look at the yui 2.3.0 RC1 it looks like there is quite alot of change for the datatable function - but unfortunatley they don't appear to have taken resolved the issue with the datatable scrolling. Any chance of a 2.3.0 version of the ymod-datatable-beta.js ???</p>","replies":[]},{"postId":"887461574","parentPostId":null,"date":"2007-07-26T03:51:22Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Hey Ted, I don't see why I couldn't port it to 2.3.0.  It wasn't a HUGE change to begin with.  Of course any enterprising YUI developer out there could do it, I believe I logged all my changes in the unminimized file above with the comment \"CHANGED\".  But if I have a bit of time after 2.3.0 comes out, I could probably do it.</p>","replies":[]},{"postId":"887461575","parentPostId":null,"date":"2007-10-27T17:43:23Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Just as an update to anyone reading the article.  Unfortunately, I have no plans to keep updating this component to the new versions of YUI that keep coming out.  It is a tiresome iterative process and I just don't have the time to keep up with it.</p><p>On the other hand, do take some time to consider if having your DataTable scroll horizontally is really the best approach to your problem.  Ideally, you want to minimize the amount of overflow on any page you're developing and a DataTable should be no exception.</p><p>In a project at work, I removed horizontal scrolling from the DataTable to upgrade our component to the newest version, and let the column widths flow fluidly with the page and it looks and performs much nicer than before.  Just remember kids, non-body overflow is the spawn of Satan.</p>","replies":[]},{"postId":"887461577","parentPostId":null,"date":"2010-05-20T03:28:53Z","author":"Queen","avatar":"https://www.gravatar.com/avatar/b38b8937dad57ad0b757bf014d767062?d=mm&s=60","message":"<p>Thanks this is great help, you are really good at explaining this sort of stuff in a dumbed down kind of way, great for people like me,</p>","replies":[]}]}}