{"disqus":{"path":"/web/registration-forms-suck-lets-mitigate-suckiness/","commentCount":4,"comments":[{"postId":"887461883","parentPostId":null,"date":"2009-01-11T15:50:00Z","author":"Harmen Janssen","avatar":"https://www.gravatar.com/avatar/c4aa503b7039b6bd94bcd7c892c94ee3?d=mm&s=60","message":"<p>This is actually something we have talked about a lot at my work. <br>We are going to try and make it easier for users to create an account by providing a <a href=\"http://Last.fm\" rel=\"nofollow noopener\" title=\"Last.fm\">Last.fm</a> account name, or a Hyves account name (Dutch community website), and hopefully in the future Facebook account names and whatnot.</p><p>I believe the barrier can be greatly reduced by offering users the possibility of logging in with existing username/password combinations, so it's our goal to support as many relevant socal media sites as possible.</p>","replies":[]},{"postId":"887461882","parentPostId":null,"date":"2009-01-11T21:33:38Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Ah, I didn't check <a href=\"http://Last.fm\" rel=\"nofollow noopener\" title=\"Last.fm\">Last.fm</a>.</p><p>It seems like there might be some interest in creating a plugin that will attempt to search out all of these data sources for more information about a user.</p><p>But one thing you should watch out for is the <a href=\"http://adactio.com/journal/1357/\" rel=\"nofollow noopener\" title=\"http://adactio.com/journal/1357/\">Password Anti-Pattern</a>.</p>","replies":[]},{"postId":"887461884","parentPostId":null,"date":"2009-01-12T03:44:34Z","author":"Chris Heilmann","avatar":"https://www.gravatar.com/avatar/07fcd228af02d476b1b8367d85a903b2?d=mm&s=60","message":"<p>It is pretty amazing what you can gather from different sources. Would be interesting to write a wrapper API that tries all these (and other) sources and gets the data as one bunch.</p><p>Zach, the next time I hear the term \"Password Anti Pattern\" I will scream. Joe end user has no clue about security as we come up with clever terms like these that don't mean anything to people outside the echo chamber. And in this case it is not at all what we are talking about. The problem with logins and passwords is that people don't get the idea that giving both to another party is a bad idea. That is not a Anti Pattern, that is just stupid, and it is time we tell the world in layman's terms. ;)</p>","replies":[]},{"postId":"887461885","parentPostId":null,"date":"2009-01-14T07:12:35Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Well, it certainly isn't Joe end user that's developing applications that implement the (wait for it) \"Password Anti Pattern.\"</p><p>I definitely understand your negativity towards the approach though, and am definitely very protective of my e-mail account credentials.  Twitter, on the other hand, not so much.</p>","replies":[]}]}}