{"disqus":{"path":"/web/et-tu-x-ua-compatible/","commentCount":3,"comments":[{"postId":"887462041","parentPostId":null,"date":"2011-10-17T14:13:11Z","author":"Aviv Ben-Yosef","avatar":"https://www.gravatar.com/avatar/07eabe24326e5c3ae83ca52ef05b9cb8?d=mm&s=60","message":"<p>Just wanted to say thanks! I just had the same problem and your post helped me solve this and fix my browser detection.</p>","replies":[]},{"postId":"887462042","parentPostId":null,"date":"2011-11-05T17:45:55Z","author":"Roatin Marth","avatar":"https://www.gravatar.com/avatar/25114afb371c6131b07a4f4ce365cbac?d=mm&s=60","message":"<p>Re \"The Document Mode determines which Conditional Comments execute, not the Browser Mode.\"</p><p>Nope, other way around. Test <a href=\"http://jsbin.com/uxahuf#noedit\" rel=\"nofollow noopener\" title=\"http://jsbin.com/uxahuf#noedit\">http://jsbin.com/uxahuf#noedit</a> in IE9, in IE9 Browser mode: you get an alert(\"9\") no matter what document mode you pick.</p>","replies":[]},{"postId":"887462044","parentPostId":null,"date":"2011-11-06T00:14:25Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Yes, Roatin, you would be right if you were strictly looking at manual modification of the Browser and Document Modes from the developer tools.  It's good that you pointed that out. That mechanism represents the Microsoft documentation correctly. But this analysis is looking at real world scenarios that developers have access to from code (X-UA-Compatible), which appears to operate differently.</p><p>Here's your test case using the meta tag:<br><a href=\"http://jsbin.com/uxahuf/2#noedit\" rel=\"nofollow noopener\" title=\"http://jsbin.com/uxahuf/2#noedit\">http://jsbin.com/uxahuf/2#n...</a></p><p>In IE8: Note the \"Setting X-UA-Compatible IE=7 using a Meta Tag (or IE=EmulateIE7)\" test cases above. The user agent clearly denotes the Browser Mode (IE8), but the Document Mode is reported as IE7.  In both test cases, only the IE7 conditional comment content is shown.</p><p>IE9: In IE9 navigator.userAgent now matches to the document mode, not to the browser mode. However, the test cases still represent Browser Mode of IE9, Document Mode of IE7, and Conditional Comments report IE7 as well.</p>","replies":[]}]}}