{"disqus":{"path":"/web/8-things-the-yui-library-needs-to-win-me-back/","commentCount":7,"comments":[{"postId":"887461641","parentPostId":null,"date":"2007-07-25T20:33:12Z","author":"Eric Miraglia","avatar":"https://www.gravatar.com/avatar/d011327f5a3d4f1dc4215968e2bfd524?d=mm&s=60","message":"<p>Zach,</p><p>We're glad to have a piece of your heart...and we're also grateful for the constructive feedback.  We're on the same page with you on almost all of these points, and we're working hard to win you over completely.  YUI 2.3.0 is almost here, and she's better-looking than ever.  She'll even cross number 8 off your list: The YAHOO Global Object now has browser detection (as of 2.3.0).  And there's some other good stuff in there that didn't make your list (but that doesn't mean you won't like it!).</p><p>Thanks again for keeping us focused on what your needs are.</p><p>Regards,<br>Eric<br>YUI Team</p>","replies":[]},{"postId":"887461645","parentPostId":null,"date":"2007-07-26T03:55:11Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Hey Eric, Thanks for the response.</p><p>It always feels like my birthday when a JavaScript framework comes out with a new version.  I'm looking forward to the release and reading the specifics!  I know a lot of people think that you can get away without doing any browser detection, but those people certainly aren't coding in the real world.</p><p>Looking forward to hearing about #'s 1-7 as well :)  Sorry I'm such a hard developer to please.</p><p>Zach</p>","replies":[]},{"postId":"887461644","parentPostId":null,"date":"2007-07-26T20:26:57Z","author":"Ivan","avatar":"https://www.gravatar.com/avatar/16738bf78c905be0117da3b8ee7a1d7f?d=mm&s=60","message":"<p>I have to admit, The Ext lib has stolen me away for exactly the same reasons.  I'd like to see YUI return to its complete glory, since it was the original inspiration behind Ext.  I'm definitely interested in a \"DomBuilder\" class of some sort, since that's a lot of what our work needs to do.  I'd say a great high level class to building HTML would work wonders.  Programmatically and via templates would be very useful.</p>","replies":[]},{"postId":"887461646","parentPostId":null,"date":"2007-12-13T01:40:56Z","author":"Jon","avatar":"https://www.gravatar.com/avatar/f81732b10f924a0c78848859f84623b2?d=mm&s=60","message":"<p>My first time using a javascript library as opposed to cobbling scripts together.  It's hard to sort the wheat from the chaff but I found a few comparison articles and decided to give YUI a go as it allegedly had good event handling and DOM manipulation modules, which cover most of what I need for this project.  So I'm underway and all is going swimmingly.  Then I remember I also need fomr validation.</p><p>My search has led me here and it looks like there is no form validation with YUI.  I don't suppose by some stroke of luck that form validation has been added since this article? :)</p>","replies":[]},{"postId":"887461652","parentPostId":null,"date":"2007-12-15T06:12:48Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Sorry John.  Looks like you're out of luck.  I've rolled my own form validation scripts from scratch, but they are by no means ready for the light of day.</p><p>But the good news is that with the new CSS selectors, it'll be easier than ever to build something to do it.</p><p>Just plug in some regexes and you'll be off to the races :)  Good luck</p>","replies":[]},{"postId":"887461648","parentPostId":null,"date":"2007-12-17T19:51:46Z","author":"Jon","avatar":"https://www.gravatar.com/avatar/f81732b10f924a0c78848859f84623b2?d=mm&s=60","message":"<p>Hi,</p><p>I found this one and tweaked it to my needs for the short term.</p><p><a href=\"http://blog.jc21.com/2007-02-05/yui-unobstrusive-javascript-validation/\" rel=\"nofollow noopener\" title=\"http://blog.jc21.com/2007-02-05/yui-unobstrusive-javascript-validation/\">http://blog.jc21.com/2007-0...</a></p><p>cheers</p>","replies":[]},{"postId":"887461649","parentPostId":null,"date":"2008-03-15T15:18:20Z","author":"Steve","avatar":"https://www.gravatar.com/avatar/6a4cd7148e451d97c5b87bf76002f8d3?d=mm&s=60","message":"<p>hi jon. the form validation u gave is good but it looks like there is a conflict with YUI RTE(Rich Text Editor) when the setting handleSubmit is true. The form still validates but its still submit the form.</p><p>anybody have a hint about this?</p>","replies":[]}]}}