{"disqus":{"path":"/web/code-like-the-big-boys-flickr/","commentCount":3,"comments":[{"postId":"887461812","parentPostId":null,"date":"2008-04-04T03:51:07Z","author":"Isaac Z. Schlueter","avatar":"https://www.gravatar.com/avatar/dea8cffd5294dcd41e75fdec4c2e604e?d=mm&s=60","message":"<p>I wouldn't read too much into the fact that there's only one JS include, or that all the CSS rulesets are each on a single line.  Many professional sites, especially those developed here at Yahoo, use some kind of build script to concatenate and minify the JS and CSS in order to save bandwidth and requests.</p><p>For example, on <a href=\"http://buzz.yahoo.com\" rel=\"nofollow noopener\" title=\"http://buzz.yahoo.com\">http://buzz.yahoo.com</a> your browser will see one JS and one CSS for every page.  However, in development, we often had 2-3 JS files for each major component, and nothing is minified.  Our build script parsed through each page when it was installed on the server, and shrunk everything down into nice browser-friendly packages.</p><p>If you don't have a build script (which is fine in many cases) then you're left balancing the needs of browsers with the needs of the development team, and the two groups often differ in what works best for them.</p><p>Personally, I can't stand CSS rulesets all on one line.  My eyes and brain just can't parse it.</p><p>Only around 10% of the browser's time is actually spent waiting for/parsing the HTML content.  The vast majority of the time is spent waiting for external components, applying CSS, and running JS.  With gzipping, the overhead of whitespace is minimal, so the isn't much advantage to removing whitespace from markup.  Some bandwidth \"saving\" techniques actually *increase* the size of the gzipped content, so it's important to actually measure output rather than just counting the characters removed.</p>","replies":[]},{"postId":"887461814","parentPostId":null,"date":"2008-04-04T05:16:57Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>It's actually funny that you mention a build script for JavaScript and CSS.  That's what I've been working on the last 2 days at work, a ANT build script that uses YUI Compressor, which as I understand, uses your CSS minimization code.  The tricky part I'm wading through right now is: How do you automate what to combine?</p><p>Do you look through your HTML source and find similar dependencies between them?  And how do you find a good balance between code that can be combined into a single file and the ability to use reuse files for cached files between different pages?</p><p>Of course, I wouldn't advocate developing a medium to large project with only one JavaScript or CSS file.  That can get seriously unwieldy when it comes to code management, team programming, and source control.  But at the end, when you push your code to production, you should trend towards that goal.</p><p>I haven't really been comfortable Gzipping content until IE6 gets the last stake in its coffin.  Do you guys sniff clients to feed Gzipped content?</p><p>I've been thinking that it might be a good idea to pick up <a href=\"http://stevesouders.com/\" rel=\"nofollow noopener\" title=\"http://stevesouders.com/\">Steve Souder's book</a> on performance optimizations for the web.  A lot of that stuff is just so much more complicated that just writing good code.  And that's definitely something I need more information on.</p>","replies":[]},{"postId":"887461813","parentPostId":null,"date":"2008-04-16T15:01:24Z","author":"Jauder Ho","avatar":"https://www.gravatar.com/avatar/e1eb91afe3c2f6dafbf4adb4c269c75a?d=mm&s=60","message":"<p>After much painful digging and testing, IE6 below XP SP2 (without the SV1 in the User Agent) does not support gzip.</p><p>With that in mind, it *is* possible to construct a webserver config to serve up gzip content to browsers that support it.</p><p>Here's my config for nginx. It should not be hard to produce an equivalent for apache.</p><p><a href=\"http://tumblelog.jauderho.com/post/27655495\" rel=\"nofollow noopener\" title=\"http://tumblelog.jauderho.com/post/27655495\">http://tumblelog.jauderho.c...</a></p>","replies":[]}]}}