{"disqus":{"path":"/web/dont-give-up-on-ie/","commentCount":3,"comments":[{"postId":"887461914","parentPostId":null,"date":"2010-04-23T22:10:50Z","author":"Arne Stephensson","avatar":"https://www.gravatar.com/avatar/8c5548eb0b2b80924f237953392df5e7?d=mm&s=60","message":"<p>This argument brings up a classic question of economics; namely, the oversimplified model of capitalism known as Supply and Demand.</p><p>On one hand, there is the idea of supply-side economics. If you build it, they will come. Nobody knew that they wanted an iPod until they knew that such a thing existed. In this scenario, developers lead and users follow. Developers create applications that people want to use, thereby facilitating usage of said applications.</p><p>Or is the situation actually reversed: people are out there clamoring for certain products and services, and corporations fall over themselves trying to accommodate this latent desire. In this scenario, developers try to understand what it is that users want, and spend their days running around and trying to cater to every possible caprice that users can voice.</p><p>Maybe I'm just a supply-side economost, but I think that developers (and corporations) who eschew outdated technologies are sending the right message to users. We simply cannot support outdated browsers and platforms forever. Things have to move forward. YouTube and Google Wave are actively taking a stand against IE and I am glad for it. IE6 is today's Netscape. Eventually we will move on, users will have a better experience (after upgrading!), and web development will be a lot more fun and a lot less of a pain-in-the-Microsoft.</p>","replies":[]},{"postId":"887461915","parentPostId":null,"date":"2010-04-23T22:13:37Z","author":"Arne Stephensson","avatar":"https://www.gravatar.com/avatar/8c5548eb0b2b80924f237953392df5e7?d=mm&s=60","message":"<p>I mean, really... all they're asking is for someone to take a few minutes to download Firefox and get it installed. Sometimes enforced change is painful, but in the end, trust me, you'll thank me for it...</p>","replies":[]},{"postId":"887461917","parentPostId":null,"date":"2010-04-24T02:24:54Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>I'm certainly not suggesting that we don't evangelize that users download new browsers.  We should definitely lead that horse to water and hope that it drinks.  But until it does drink, we have to continue supporting what the users actually have.</p>","replies":[]}]}}