{"disqus":{"path":"/web/if-the-menu-fitts-we-must-acquit/","commentCount":8,"comments":[{"postId":"887461950","parentPostId":null,"date":"2010-02-16T23:01:33Z","author":"James Padolsey","avatar":"https://www.gravatar.com/avatar/0277dde1b6440039c4225b60d52e8ff5?d=mm&s=60","message":"<p>Great post Zach! And an excellent point!</p><p>FWIW, Opera (I tested v. 10) seems to be compatible with this \"law\" too.</p>","replies":[]},{"postId":"887461952","parentPostId":null,"date":"2010-02-17T21:14:43Z","author":"Jordan","avatar":"https://www.gravatar.com/avatar/1a50089308f04596f082e081b9514ade?d=mm&s=60","message":"<p>IE8 (fullscreen mode) on Win7/Server 2008 R2 works on both cases (disabling the status bar).<br>Chromium (fullscreen mode) on Win7/Server 2008 R2 said some mean words and didn't work in either case.</p><p>After I went and did this I saw that you noted the fullscreen mode was out of scope, but I thought I'd let you know the results anyway.</p><p>Thanks for the write-up. It's a very interesting thought - definitely something to consider when designing navigation. Multi-monitor situations are another interesting case for this, but I'm guessing isn't common enough to stress over.</p>","replies":[]},{"postId":"887461951","parentPostId":null,"date":"2010-02-17T21:39:47Z","author":"Daniel Shaw","avatar":"https://www.gravatar.com/avatar/d148aa5680803f5285a675778f51ac66?d=mm&s=60","message":"<p>Great post Zach. Very interesting observations.</p><p>I have two monitors and have one to the left of my main browsing window. Interesting how that infinite edge disappears when I have to consciously stop in that space.</p>","replies":[]},{"postId":"887461953","parentPostId":null,"date":"2010-02-20T04:30:30Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Thanks guys.</p><p>Also, another thought: the \"infinite edge\" case doesn't quite apply for touchscreen interfaces.</p>","replies":[]},{"postId":"887461955","parentPostId":null,"date":"2010-04-23T21:59:02Z","author":"Arne Stephensson","avatar":"https://www.gravatar.com/avatar/8c5548eb0b2b80924f237953392df5e7?d=mm&s=60","message":"<p>In the examples you gave, the interface don't reach exactly to the left edge of the screen because the lack of whitespace would make things UGLY. Whitespace, like Fitt's Overrated Law, is also a huge usability factor.</p><p>There are two things you're placing at odds: the speed at which you can slam your cursor against the left edge of the screen, and the speed at which your eye can actually make out text better because of proper whitespace.</p><p>I don't think the two things have to be placed at odds, but if you say they have to be, then I'd argue that adequate whitespace (as shown in the Wordpress and Gmail menus) is preferred over things like Fitt's Law.</p><p>I admire gratuitous use of whitespace in application and website design. I don't think most people are out to turn their users into the most efficient robots possible, shaving milliseconds off of the time that people can click the Spam folder in Gmail. Don't be such an engineer. Aesthetics is a huge part of usability. Your demo proves a point but... it's ugly. Fitt's Law might apply to more labor-intensive interfaces (like the menus at the top of the screen in Mac OS X, which are constantly being accessed), but when an application is just one of many, or when (as in your demo) it's just a blog with a few links, I think whitespace is a more important usability goal than Fitt's Law.</p>","replies":[]},{"postId":"887461956","parentPostId":null,"date":"2010-05-06T02:41:08Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>You can still have whitespace and an attractive looking click target.  The hover background doesn't necessarily need to be 1:1 with the click target. Won't apologize for being an engineer though :)</p>","replies":[]},{"postId":"887461957","parentPostId":null,"date":"2010-10-25T14:10:48Z","author":"Dr. Curiosity","avatar":"https://www.gravatar.com/avatar/b93934df6f82d915940f27f000073daa?d=mm&s=60","message":"<p>Hi there, I just randomly found this while looking for other usability issues regarding Fitts' Law on the Mac.</p><p>While your flush-left menu is an interesting idea, it completely fails to be any more useful than any other left-hand menu with my computer setup.  To make better use of the real estate on a display that's considerably wider than it is high, I have Chrome set to display my tabs... you guessed it, along the left-hand side of the browser. Even when it's in full-screen mode with the tabs hidden, I can't rely on hitting the edge for menu selection because I'm browsing on my right-hand monitor. Going too far left puts me on my laptop screen where the coding and the console windows live.</p><p>Another thing I'd note is that the menu targets could be more immediately visible. On first seeing them, I'd assume that only the text was clickable. Moving my cursor up to \"About Zach Leatherman\", I found myself distracted by the fact that there's some clear space turning black under my cursor before I've even reached my intended target, or anything that looks like a target.</p><p>With things that look like buttons (or even bordered boxes), there come user affordances. We expect that something might react when we cross into or over a bordered region. When all there is between areas of white space is a faint grey line, it comes as a surprise.</p><p>Recall also that Fitts' Law has a perceptual feedback basis, and having a large target isn't so useful if it isn't <em>perceivable</em> as a large target. If you find that something doesn't meet your target expectations, it can slow you down - for example, I've seen sites where the background colour of a link changes when you hover over the region it's in, but only the text itself is actually clickable.</p><p>In any case, I hope my unsolicited feedback was useful, or at least interesting. All the best!</p>","replies":[]},{"postId":"1195641128","parentPostId":null,"date":"2014-01-10T22:38:11Z","author":"Thomas Hendrickx","avatar":"https://www.gravatar.com/avatar/b06d7d22571fdf80fa99658a858a7985?d=mm&s=60","message":"<p>Hi, In search of more information about Fitts law I came accros this post.</p><p>I found it rather interesting to find out that one of the examples that you used still does not implement the use of the corners and borders (gmail). For a course I’m following, Human Computer Interaction, we had to read a paper and this post reminded me about that. It describes a new model to unite Fitts and Hick-Hyman laws together (I have a link at the bottom).</p><p>They stated that the use of the Hick-Hyman law is rather low in determining the efficiency of a menu (like the ones in your example). They also incorporated a way to implement the experience of the user. By combining all that the proposed model can predict the efficiency of a menu better (higher R²) than models it was tested against.</p><p>However they did say that the way they measured experience still needed some more development. Certain menu designs like the Bederson’s Fisheye menu, which dynamicly adjust the location and size of items are harder to model than anticipated.</p><p>All in all an interesting article which I could recommend.</p><p>Thomas</p><p><a href=\"http://ir.canterbury.ac.nz/bitstream/10092/662/1/12602883_paper191-cockburn.pdf\" rel=\"nofollow noopener\" title=\"http://ir.canterbury.ac.nz/bitstream/10092/662/1/12602883_paper191-cockburn.pdf\">http://ir.canterbury.ac.nz/...</a></p>","replies":[]}]}}