{"disqus":{"path":"/web/fumbling-with-social-media/","commentCount":12,"comments":[{"postId":"887462118","parentPostId":null,"date":"2013-01-28T07:12:04Z","author":"@cwebba1","avatar":"https://www.gravatar.com/avatar/b5c2825f74b5a0d4ed196287c6b692fe?d=mm&s=60","message":"<p>What makes this a Great Post is your willingness to be honest, humble, vulnerable and raw. Because you hitched your numbers to vulnerable truths, you created an insightful map worth following. Very informative and to the point. Thank you!</p>","replies":[]},{"postId":"887462121","parentPostId":null,"date":"2013-01-28T07:15:03Z","author":"Randy Anderson","avatar":"https://www.gravatar.com/avatar/89d2404d075053cf31b88bdec825b4e5?d=mm&s=60","message":"<p>Hi Zach! Thanks for your post. I am a web developer trying to reach a wider audience through Twitter and other social networking platforms, and I'm hoping that I can offer them some sort of advice and also learn something from them as well.</p><p>I also love looking at statistics and analytics! I'm hopeful that when I get more subscribers and followers I'll still enjoy it.</p><p>Anyway, just wanted to say that I enjoyed the post, looking to read more great articles from you soon. Thanks!</p>","replies":[]},{"postId":"887462123","parentPostId":null,"date":"2013-01-28T09:21:17Z","author":"Matt Polichette","avatar":"https://www.gravatar.com/avatar/ce937436134a30efe6ed84f676375c0a?d=mm&s=60","message":"<p>Thanks for sharing.  As a developer just starting out, it can be hard to even know where to start.  The more you guys share the better for us all.  I look forward to reading more from you!</p><p>P.S.  One more twitter follower! :)   <br>-Matt</p>","replies":[]},{"postId":"887462122","parentPostId":null,"date":"2013-01-28T20:55:09Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Wow guys, thanks for the encouragement!</p>","replies":[]},{"postId":"887462124","parentPostId":null,"date":"2013-01-28T21:11:44Z","author":"Matt Smith","avatar":"https://www.gravatar.com/avatar/1ba19b20dfd597b96b1b780a0bbb6dd8?d=mm&s=60","message":"<p>Great write-up, Zach! I know more than a few devs who've yet to really touch social media  as a way help their careers along so this was good to read about your journey with it.</p>","replies":[]},{"postId":"887462127","parentPostId":null,"date":"2013-01-29T21:42:37Z","author":"Edan Hewitt","avatar":"https://www.gravatar.com/avatar/09babaa91f5209f18fb94ace79256223?d=mm&s=60","message":"<p>It shouldn't have to be this way (getting exposure from the higher ups) - but it does help if you're new to the game. Smashing Mag, and influential peeps on Twitter who share your projects are always a wonderful thing. And doing mini E-Mail campaigns asking others to upvote a link on Hackernews goes a long way too.</p><p>I am not saying we shouldn't get others to make us temporarily famous, but as I said, your work for The Community should never have to rely on others' social media klout, or status, to be known (well).</p><p>Other things play a part in getting recognition. It's also SEO, word of mouth, E-Mailing editors on blogs, posting videos on Youtube. Doing screencasts, editing wikis on Github, constantly harassing Big Tech blogs to get your name dropped in an article, Instant Messaging influential people on Facebook. Befriending higher-ups on Twitter and sending requests to mention a link.</p><p>In short, it's about infiltration and constant harassment of every digital stronghold for the express purpose of being known and out there, and even more 'in' our little scene.</p><p>And believe me, it's not hard. This is the Internet, remember?! I believe the best projects will rise to the top anyways. If your idea is shot down by The Community don't take it down. Just improve it until it becomes awesome. The Community welcomes all types of hard work. If it seems shoddy, or rushed, it will be rejected and ridiculed.</p>","replies":[]},{"postId":"887462129","parentPostId":null,"date":"2013-01-30T01:19:37Z","author":"Brett","avatar":"https://www.gravatar.com/avatar/af4ffd88857ef429ac98c1acf9a0e2f3?d=mm&s=60","message":"<p>Good advice Zach. I can say that plastering your name over everything feels odd, but I see more and more the need to do it.</p><p>\"Oh—SocialCount? You built that?\"  I can completely relate with this. It's nice to be recognized for our work. It makes creating open source code fun.</p>","replies":[]},{"postId":"887462126","parentPostId":null,"date":"2013-03-17T21:33:43Z","author":"AJ","avatar":"https://www.gravatar.com/avatar/1d262c41679fccdcd0c2b8150be3475c?d=mm&s=60","message":"<p>By association old people physically or mentally, require a developing young fresh vantage point to keep creation to its simplistic (KISS) essence. We all need to go to the well often. As we look in, we see inside the water and our reflection, depending on the light. Thanks for keeping ME mentally fresh. Good job!</p>","replies":[]},{"postId":"887462119","parentPostId":null,"date":"2013-03-20T20:21:19Z","author":"Dan Farrow","avatar":"https://www.gravatar.com/avatar/a009e11e36f1fc6ec77306527b5f9415?d=mm&s=60","message":"<p>hi Zach, thanks for posting this. It helped me realise that it's high time I was less of a professional recluse.</p><p>By the way, your final Google+ link actually points to Twitter.</p><p>Maybe you did this intentionally, since Twitter follows are worth more, in which case I have to admit your cunning ruse worked! I clicked the link and ended up on Twitter, then decided I may as well follow you there instead :)</p><p>Cheers,<br>Dan</p>","replies":[]},{"postId":"887462120","parentPostId":null,"date":"2013-03-20T21:04:12Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Dan: Ha! Completely unintentional. Fixed, though!</p>","replies":[]},{"postId":"887462117","parentPostId":null,"date":"2013-03-20T21:17:55Z","author":"Dan Farrow","avatar":"https://www.gravatar.com/avatar/a009e11e36f1fc6ec77306527b5f9415?d=mm&s=60","message":"<p>Great, now I'm following you there too :)</p><p>Oh one other thing I just noticed: the notification email from <a href=\"http://WordPress.com\" rel=\"nofollow noopener\" title=\"WordPress.com\">WordPress.com</a> contains links to http://zachleat.com.local/web/fumbling-with-social-media (which I'm guessing is your local dev version) which aren't accessible.</p><p>I can forward the email to you if you like - you've got my email address now so just let me know :)</p>","replies":[]},{"postId":"887462130","parentPostId":null,"date":"2013-03-21T04:08:10Z","author":"Zach Leatherman","avatar":"https://www.gravatar.com/avatar/e1899004c71c7043343196103e210be3?d=mm&s=60","message":"<p>Naw, thanks though—this blog is moving from Wordpress to Jekyll soon.</p>","replies":[]}]}}